In [3]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 

# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['a','b','c','d'])

df.reindex(['b','c','d','a'])

     Name  Age    Address Qualification  Mobile No
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76
a     Jai   27     Nagpur           Msc         97

In [5]:
for i in df.iterrows():
    print(i)

('a', Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object)
('b', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object)
('c', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object)
('d', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object)

In [11]:
for i,j in df.iterrows():
    print(i, j)

a Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object
b Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object
c Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object
d Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object

In [13]:
for i in df.items():
    print (i)

('Name', a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object)
('Age', a    27
b    24
c    22
d    32
Name: Age, dtype: int64)
('Address', a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object)
('Qualification', a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object)
('Mobile No', a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64)

In [27]:
for i,j in df.items():
    print(i,j)

Name a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object
Age a    27
b    24
c    22
d    32
Name: Age, dtype: int64
Address a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
Qualification a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object
Mobile No a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64

In [28]:
for i,j in df.items():
    print(j)

a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object
a    27
b    24
c    22
d    32
Name: Age, dtype: int64
a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object
a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64

In [29]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [30]:
allData= []
for i, j in df.iterrows():
    # print(j['Name'])
    oneData = {
        'Name': j['Name'],
        'Age' : j['Age'],
        'Address' : j['Address'],
        'Qualification' : j['Qualification'],
        'Mobile No' : j['Mobile No'],
    }
    allData.append(oneData)

print(allData)

[{'Name': 'Jai', 'Age': 27, 'Address': 'Nagpur', 'Qualification': 'Msc', 'Mobile No': 97}, {'Name': 'Princi', 'Age': 24, 'Address': 'Kanpur', 'Qualification': 'MA', 'Mobile No': 91}, {'Name': 'Gaurav', 'Age': 22, 'Address': 'Allahabad', 'Qualification': 'MCA', 'Mobile No': 58}, {'Name': 'Anuj', 'Age': 32, 'Address': 'Kannuaj', 'Qualification': 'Phd', 'Mobile No': 76}]

In [33]:
list(df["Name"])

4

In [34]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [41]:
for i in df.columns:
    print (i, df[i].sum())

Name JaiPrinciGauravAnuj
Age 105
Address NagpurKanpurAllahabadKannuaj
Qualification MscMAMCAPhd
Mobile No 322

In [43]:
df.apply(lambda x: x.sum())

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [44]:
def test(a):
    return a.sum()
df.apply(test)

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [52]:
def test(a):   
    b=str(a)
    return b.sum()
df.apply(test,axis=1)

AttributeError: 'str' object has no attribute 'sum'

In [54]:
df2=df[["Age","Mobile No"]]
df2

   Age  Mobile No
a   27         97
b   24         91
c   22         58
d   32         76

In [61]:
df2.applymap(lambda x: x**2)

    Age  Mobile No
a   729       9409
b   576       8281
c   484       3364
d  1024       5776

In [62]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [63]:
df.sort_values("Name")

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91

In [66]:
df.sort_index(ascending=False)

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
b  Princi   24     Kanpur            MA         91
a     Jai   27     Nagpur           Msc         97

In [92]:
pd.set_option("display.max_colwidth", 1000)

df1=pd.DataFrame({
    "Desc":["Aditya","Hi i am learning Ds", "The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. TThe lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.he characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content. The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content."]
})

In [93]:
df1

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Desc
0                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   Aditya
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Hi i am learning Ds
2  The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. TThe lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.he characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contai...

In [100]:
df1["length"]=df1['Desc'].apply(lambda x: len(x.split()))
df1

,Desc,length
0,Aditya,1
1,Hi i am learning Ds,5
2,The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. TThe lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contains all the letters of the alphabet. The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.he characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The characters are spread out evenly so that the reader’s attention is focused on the layout of the text instead of its content.The lorem ipsum is a placeholder text used in publishing and graphic design. This filler text is a short paragraph that contai...,302